# Common software that I need installed when setting up a new Mac
#
# install this stuff by running `brew bundle` after homebrew is installed
#
cask "flux"
cask "aerial"
cask "docker"
cask "font-fira-code"
cask "metabase"
cask "spotify"
cask "menumeters"
tap "railwaycat/emacsmacport"
brew "git"
brew "leiningen"
brew "elixir"
brew "zsh"
brew "emacs-mac", args: ["with-modern-icon"]
brew "keychain"
brew "ag"
cask "kindle"
cask "iterm2"
# untested
# cask "dropbox"
