# Common software that I need installed when setting up a new Mac
#
# install this stuff by running `brew bundle` after homebrew is installed
#
cask "flux"
cask "aerial"
cask "docker"
cask "font-fira-code"
cask "metabase"
cask "spotify"
cask "menumeters"
cask "kindle"
cask "iterm2"
cask "ngrok"
tap "railwaycat/emacsmacport"
brew "git"
brew "git-extras"
brew "leiningen"
brew "elixir"
brew "hugo"
brew "zsh"
brew "emacs-mac", args: ["with-modern-icon" "with-natural-title-bar"]
brew "keychain"
brew "ag"
brew "postgresql"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
# untested
# cask "dropbox"
